
*** Setup

An =intake= folder is created for each dataset, containing two files:

1. cryo-data.meta

#+BEGIN_SRC bash :exports results :results verbatim
cat template/cryo-data.meta
#+END_SRC

#+RESULTS:
: cryo-data name| template
: DOI | 
: author | author_yyyy
: project | 
: product | 
: repository | 
: misc | template

2. cryo-data-download.{sh,py}

#+BEGIN_SRC bash :exports results :results verbatim
cat template/cryo-data-download.sh
#+END_SRC

#+RESULTS:
: #!/usr/bin/env bash
: 
: # can be more involved, e.g. wrapping download-url in a wget spyder
: # See also https://docs.datalad.org/en/stable/generated/man/datalad-addurls.html
: datalad download-url https://filesamples.com/samples/document/txt/sample1.txt
: 

